# -*- coding: utf-8 -*-
from __future__ import unicode_literals
from hazm import *

stop_words = ['و','در','به','از','که','می','این','است','را','با','های','برای','آن','یک','شود','شده','خود','ها','کرد','شد','ای','تا','کند','بر','بود','گفت','نیز','وی','هم','کنند','دارد','ما','کرده','با','اما','باید','دو','اند','هر','خواهد','او','مورد','آنها','باشد','دیگر','مردم','نمی','بین','پیش','پس','اگر','همه','صورت','یکی','هستند','بی','من','دهد'
       ,       'هزار','نیست','استفاده','داد','داشته','راه','داشت','چه','همچنین','کردند','داده','بوده','دارند','همین','سوی','شوند','بیشتر','بسیار','روی','گرفته','هایی','تواند','اول','نام','هیچ','چند','بیش','شدن','کردن','کنیم','نشان','حتی','اینکه','ولی','توسط','چنین','برخی','نه','دیروز','دوم','درباره','بعد','مختلف','گیرد','شما','گفته','آنان','بار','طور','گرفت','دهند','گذاری','بسیاری','بودند'
    ,'بودند','بدون','تمام','کل','براساس','تر','شدند','ترین','امروز','باشند','ندارد','چون','قابل','گوید','دیگری','همان','خواهند','قبل','آمده','اکنون','تحت','طریق','گیری','جای','هنوز','چرا','البته','کنید','سازی','سوم','کنم','بلکه','زیر','توانند','ضمن','فقط','بودن','حق','آید','وقتی','اش','باید','نخستین','مقابل','تاکنون','مانند','تازه','آورد','فکر','آنچه','نخست','نشده'
       ,       'شاید','چهار','جریان','پنج','ساخته','زیرا','نزدیک','برداری','کسی','ریزی','رفت','گردد','مثل','آمد','ام','بهترین','دانست','کمتر','دادن','تمامی','جلوگیری','بیشتری','ایم','ناشی','چیزی','آنکه','بالا','بنابراین','ایشان','بعضی','برخوردار','نخواهد','هنگام','نباید','غیر','دیده','نبود','داریم','چگونه','بندی','خواست','فوق','ده','نوعی','هستیم','دیگران','همچنان','سراسر','ندارند','گروهی','سعی'
    ,'روزهای','آنجا','یکدیگر','کردم','بیست','بروز','سپس','رفته','آورده','نماید','باشیم','گویند','زیاد','خویش','همواره','گذاشته','شش','نداشته','شناسی','خواهیم','داشتن','نظیر','باره','همچون','نکرده','هفت','دانند','جایی','بی','جز','زیر','روی','توی','جلوی','عقب','بالای','خارج','وسط','بیرون','کنار','نزد','دنبال','حدود','برابر','طبق','مانند','ضد','هنگام','اثر','علت','سمت','عنوان'
       ,       'قصد','جدا','کی','که','چیست','هست','کجا','کجاست','چطور','کدام','آیا','مگر','چندین','دیگر','کسی','هیچ','چیز','جا','بله','بلی','آره','آری','مرسی','وقتیکه','همین','مدتی','مان','تان','شود','تا','ها','عرض','.','?','!',':',';','"','،',',']


with open("in.txt", "r" , encoding="utf-8") as f:
    file_list = f.readlines()
    o = open("out6.txt", "w" , encoding="utf-8")

    for line in file_list:
        words = []
        input_string = line
        normalizer = Normalizer()
        s = normalizer.normalize(input_string)
        sentence = sent_tokenize(s)

        for sentence in sentence:

         w = word_tokenize(sentence)
         words += w

        filtered_word_list = words[:]
        for word in filtered_word_list:
             if word in stop_words:
                 filtered_word_list.remove(word)

        result_dict = dict( [ (i, filtered_word_list.count(i)) for i in set(filtered_word_list) ] )
        length=str(len(filtered_word_list))


        o.write('{0} : {1}'.format(result_dict,length ))
        o.write('\n')

    o.close()
